; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v13 ?v9)
             (pred_10 ?v10 ?v7)
             (pred_6 ?v13 ?v7)
             (pred_7 ?v6 ?v13 )
	     (pred_1 ?v13)
             (pred_5 ?v3)
             (pred_2 ?v10)
             (pred_9 ?v7)
             (pred_3 ?v13)
             (pred_4 ?v10)
             (pred_12 ?v13)
             (pred_11 ))



(:action op_1
:parameters (?v12 ?v1 ?v11 ?v4)
:precondition (and (pred_5 ?v12) (pred_5 ?v1) (pred_2 ?v11) (pred_9 ?v4)
          (pred_8 ?v12 ?v1) (pred_10 ?v11 ?v4)
                   (pred_6 ?v1 ?v4) (pred_1 ?v12) 
                   (pred_3 ?v1) (pred_4 ?v11))
:effect (and  (pred_12 ?v1) (not (pred_3 ?v1))))


(:action op_4
:parameters (?v12 ?v2)
:precondition (and (pred_5 ?v12) (pred_5 ?v2)
               (pred_1 ?v12) (pred_8 ?v12 ?v2) (pred_12 ?v2))
:effect (and (pred_1 ?v2) (not (pred_1 ?v12))))

(:action op_3
:parameters (?v12 ?v11)
:precondition (and (pred_5 ?v12) (pred_2 ?v11) 
                  (pred_1 ?v12) (pred_7 ?v11 ?v12) (pred_11 ))
:effect (and (pred_4 ?v11)
   (not (pred_7 ?v11 ?v12)) (not (pred_11 ))))


(:action op_2
:parameters (?v12 ?v8 ?v5)
:precondition (and (pred_5 ?v12) (pred_2 ?v8) (pred_2 ?v5)
                  (pred_1 ?v12) (pred_4 ?v5) (pred_7 ?v8 ?v12))
:effect (and (pred_4 ?v8) (pred_7 ?v5 ?v12)
        (not (pred_4 ?v5)) (not (pred_7 ?v8 ?v12))))

(:action op_5
:parameters (?v12 ?v11)
:precondition (and (pred_5 ?v12) (pred_2 ?v11) 
                  (pred_1 ?v12) (pred_4 ?v11))
:effect (and (pred_11 ) (pred_7 ?v11 ?v12) (not (pred_4 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_07 obj_23 obj_18 obj_05 obj_27 obj_16 obj_09 obj_30 obj_14 obj_17 obj_12 obj_28 obj_01 obj_25 obj_13 obj_08 obj_06 obj_02 obj_10 obj_21 obj_15 obj_11 obj_20 obj_29
    obj_24 obj_19
    obj_26 obj_04 obj_22
    )

    (:init
       (pred_11)

       (pred_5 obj_03)
       (pred_5 obj_07)
       (pred_5 obj_23)
       (pred_5 obj_18)
       (pred_5 obj_05)
       (pred_5 obj_27)
       (pred_5 obj_16)
       (pred_5 obj_09)
       (pred_5 obj_30)
       (pred_5 obj_14)
       (pred_5 obj_17)
       (pred_5 obj_12)
       (pred_5 obj_28)
       (pred_5 obj_01)
       (pred_5 obj_25)
       (pred_5 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_21)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_29)
       (pred_9 obj_24)
       (pred_9 obj_19)
       (pred_2 obj_26)
       (pred_2 obj_04)
       (pred_2 obj_22)

       (pred_8 obj_03 obj_27)
       (pred_8 obj_03 obj_07)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_07 obj_23)
       (pred_8 obj_07 obj_03)
       (pred_8 obj_23 obj_09)
       (pred_8 obj_23 obj_18)
       (pred_8 obj_23 obj_07)
       (pred_8 obj_18 obj_30)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_18 obj_23)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_05 obj_18)
       (pred_8 obj_27 obj_17)
       (pred_8 obj_27 obj_16)
       (pred_8 obj_27 obj_03)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_16 obj_09)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_16 obj_27)
       (pred_8 obj_09 obj_28)
       (pred_8 obj_09 obj_30)
       (pred_8 obj_09 obj_23)
       (pred_8 obj_09 obj_16)
       (pred_8 obj_30 obj_01)
       (pred_8 obj_30 obj_14)
       (pred_8 obj_30 obj_18)
       (pred_8 obj_30 obj_09)
       (pred_8 obj_14 obj_25)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_14 obj_30)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_27)
       (pred_8 obj_12 obj_08)
       (pred_8 obj_12 obj_28)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_28 obj_06)
       (pred_8 obj_28 obj_01)
       (pred_8 obj_28 obj_09)
       (pred_8 obj_28 obj_12)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_25)
       (pred_8 obj_01 obj_30)
       (pred_8 obj_01 obj_28)
       (pred_8 obj_25 obj_10)
       (pred_8 obj_25 obj_14)
       (pred_8 obj_25 obj_01)
       (pred_8 obj_13 obj_21)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_08 obj_12)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_06 obj_28)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_10 obj_29)
       (pred_8 obj_10 obj_25)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_21 obj_15)
       (pred_8 obj_21 obj_13)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_15 obj_21)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_06)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_20 obj_29)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_29 obj_10)
       (pred_8 obj_29 obj_20)
       (pred_3 obj_05)
       (pred_3 obj_21)
       (pred_3 obj_13)
       (pred_6  obj_05 obj_24)
       (pred_6  obj_21 obj_19)
       (pred_6  obj_13 obj_19)
       (pred_12 obj_03)
       (pred_12 obj_07)
       (pred_12 obj_23)
       (pred_12 obj_18)
       (pred_12 obj_27)
       (pred_12 obj_16)
       (pred_12 obj_09)
       (pred_12 obj_30)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_12)
       (pred_12 obj_28)
       (pred_12 obj_01)
       (pred_12 obj_25)
       (pred_12 obj_08)
       (pred_12 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_10)
       (pred_12 obj_15)
       (pred_12 obj_11)
       (pred_12 obj_20)
       (pred_12 obj_29)

       (pred_10  obj_26 obj_24)
       (pred_10  obj_04 obj_19)
       (pred_10  obj_22 obj_24)
       (pred_7 obj_26 obj_10)
       (pred_7 obj_04 obj_15)
       (pred_7 obj_22 obj_12)
       (pred_1 obj_06)
    )

    (:goal (and
       (pred_7 obj_26 obj_16)
       (pred_7 obj_04 obj_01)
    ))
(:constraints
  (always (not (pred_1 obj_08)))
)
)

; plan
1. (op_4 obj_06 obj_11)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_11)
   goals met: 0 of 2
2. (op_4 obj_11 obj_15)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_15)
   goals met: 0 of 2
3. (op_3 obj_15 obj_04)
   deleted: (pred_7 obj_04 obj_15) (pred_11)
   added: (pred_4 obj_04)
   goals met: 0 of 2
4. (op_4 obj_15 obj_11)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_11)
   goals met: 0 of 2
5. (op_4 obj_11 obj_06)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_06)
   goals met: 0 of 2
6. (op_4 obj_06 obj_02)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_02)
   goals met: 0 of 2
7. (op_4 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 0 of 2
8. (op_5 obj_01 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_11) (pred_7 obj_04 obj_01)
   goals met: 1 of 2
9. (op_4 obj_01 obj_25)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_25)
   goals met: 1 of 2
10. (op_4 obj_25 obj_10)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_10)
   goals met: 1 of 2
11. (op_3 obj_10 obj_26)
   deleted: (pred_7 obj_26 obj_10) (pred_11)
   added: (pred_4 obj_26)
   goals met: 1 of 2
12. (op_4 obj_10 obj_25)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_25)
   goals met: 1 of 2
13. (op_4 obj_25 obj_14)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_14)
   goals met: 1 of 2
14. (op_4 obj_14 obj_30)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_30)
   goals met: 1 of 2
15. (op_4 obj_30 obj_09)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_09)
   goals met: 1 of 2
16. (op_4 obj_09 obj_16)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_16)
   goals met: 1 of 2
17. (op_5 obj_16 obj_26)
   deleted: (pred_4 obj_26)
   added: (pred_11) (pred_7 obj_26 obj_16)
   goals met: 2 of 2
